In [1]:
#Importing the required Libraries
import numpy as np
import pandas as pd
import seaborn as sns
import scipy.stats as stats
import matplotlib.pyplot as plt
from statsmodels.formula.api import ols      
from statsmodels.stats.anova import _get_covariance,anova_lm 
from scipy.stats import zscore
from sklearn.decomposition import PCA
%matplotlib inline

In [3]:
df=pd.read_csv("dataset_group.csv")

In [4]:
df.head()

         Date  Order_id        Product
0  2018-01-01         1         yogurt
1  2018-01-01         1           pork
2  2018-01-01         1  sandwich bags
3  2018-01-01         1     lunch meat
4  2018-01-01         1   all- purpose

In [5]:
df.tail()

             Date  Order_id            Product
20636  2020-02-25      1138               soda
20637  2020-02-25      1138       paper towels
20638  2020-02-26      1139               soda
20639  2020-02-26      1139  laundry detergent
20640  2020-02-26      1139            shampoo

In [6]:
df.describe().T

            count        mean         std  min    25%    50%    75%     max
Order_id  20641.0  575.986289  328.557078  1.0  292.0  581.0  862.0  1139.0

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20641 entries, 0 to 20640
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      20641 non-null  object
 1   Order_id  20641 non-null  int64
 2   Product   20641 non-null  object
dtypes: int64(1), object(2)
memory usage: 483.9+ KB

In [8]:
df.isnull().sum()

Date        0
Order_id    0
Product     0
dtype: int64

In [12]:
dups=df.duplicated().sum()
print("There are",dups,"dupicate values in the dataset")

There are 4730 dupicate values in the dataset

In [17]:
df1=df.drop_duplicates()

In [20]:
df1.duplicated().sum()

0

In [21]:
df1.to_csv("datset_group1.csv")

In [22]:
df1.to_excel("dataset_group1.xlsx")